mauzybroadway/microsynth/windows/wetzel_440S15_project/added/stm324xg_eval-reduced.c
  // /* Enable the BUTTON Clock */
  // RCC_AHB1PeriphClockCmd(BUTTON_CLK[Button], ENABLE);
  // RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);

  // /* Configure Button pin as input */
  // GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
  // GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  // GPIO_InitStructure.GPIO_Pin = BUTTON_PIN[Button];
  // GPIO_Init(BUTTON_PORT[Button], &GPIO_InitStructure);


  // if (Button_Mode == BUTTON_MODE_EXTI)
  // {
    // /* Connect Button EXTI Line to Button GPIO Pin */
    // SYSCFG_EXTILineConfig(BUTTON_PORT_SOURCE[Button], BUTTON_PIN_SOURCE[Button]);

    // /* Configure Button EXTI line */
    // EXTI_InitStructure.EXTI_Line = BUTTON_EXTI_LINE[Button];
    // EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;

    // if(Button != BUTTON_WAKEUP)
    // {
      // EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;  
    // }
    // else
    // {
      // EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;  
    // }
    // EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    // EXTI_Init(&EXTI_InitStructure);

    // /* Enable and set Button EXTI Interrupt to the lowest priority */
    // NVIC_InitStructure.NVIC_IRQChannel = BUTTON_IRQn[Button];
    // NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x0F;
    // NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x0F;
    // NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;

    // NVIC_Init(&NVIC_InitStructure); 
  // }
// }


/**
  * @brief  Returns the selected Button state.
  * @param  Button: Specifies the Button to be checked.
  *   This parameter can be one of following parameters:    
  *     @arg BUTTON_WAKEUP: Wakeup Push Button
  *     @arg BUTTON_TAMPER: Tamper Push Button  
  *     @arg BUTTON_KEY: Key Push Button 
  *     @arg BUTTON_RIGHT: Joystick Right Push Button 
  *     @arg BUTTON_LEFT: Joystick Left Push Button 
  *     @arg BUTTON_UP: Joystick Up Push Button 
  *     @arg BUTTON_DOWN: Joystick Down Push Button
  *     @arg BUTTON_SEL: Joystick Sel Push Button    
  * @retval The Button GPIO pin value.
  */

// !!wmh (single line commented block below)
// uint32_t STM_EVAL_PBGetState(Button_TypeDef Button)
// {
  // return GPIO_ReadInputDataBit(BUTTON_PORT[Button], BUTTON_PIN[Button]);
// }


/**
  * @brief  Configures COM port.
  * @param  COM: Specifies the COM port to be configured.
  *   This parameter can be one of following parameters:    
  *     @arg COM1
  *     @arg COM2  
  * @param  USART_InitStruct: pointer to a USART_InitTypeDef structure that
  *   contains the configuration information for the specified USART peripheral.
  * @retval None
  */
// !!wmh (single line commented block below)
// void STM_EVAL_COMInit(COM_TypeDef COM, USART_InitTypeDef* USART_InitStruct)
// {
  // GPIO_InitTypeDef GPIO_InitStructure;

  // /* Enable GPIO clock */
  // RCC_AHB1PeriphClockCmd(COM_TX_PORT_CLK[COM] | COM_RX_PORT_CLK[COM], ENABLE);

  // if (COM == COM1)
  // {
    // /* Enable UART clock */
    // RCC_APB1PeriphClockCmd(COM_USART_CLK[COM], ENABLE);
  // }

  // /* Connect PXx to USARTx_Tx*/
  // GPIO_PinAFConfig(COM_TX_PORT[COM], COM_TX_PIN_SOURCE[COM], COM_TX_AF[COM]);

  // /* Connect PXx to USARTx_Rx*/
  // GPIO_PinAFConfig(COM_RX_PORT[COM], COM_RX_PIN_SOURCE[COM], COM_RX_AF[COM]);

  // /* Configure USART Tx as alternate function  */
  // GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  // GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
  // GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;

  // GPIO_InitStructure.GPIO_Pin = COM_TX_PIN[COM];
  // GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  // GPIO_Init(COM_TX_PORT[COM], &GPIO_InitStructure);

  // /* Configure USART Rx as alternate function  */
  // GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  // GPIO_InitStructure.GPIO_Pin = COM_RX_PIN[COM];
  // GPIO_Init(COM_RX_PORT[COM], &GPIO_InitStructure);

  // /* USART configuration */
  // USART_Init(COM_USART[COM], USART_InitStruct);
    
  // /* Enable USART */
  // USART_Cmd(COM_USART[COM], ENABLE);
// }

/**
  * @brief  DeInitializes the SDIO interface.
  * @param  None
  * @retval None
  */

// !!wmh (single line commented block below)
// void SD_LowLevel_DeInit(void)
// {
  // GPIO_InitTypeDef  GPIO_InitStructure;
  
  // /*!< Disable SDIO Clock */
  // SDIO_ClockCmd(DISABLE);
  
  // /*!< Set Power State to OFF */
  // SDIO_SetPowerState(SDIO_PowerState_OFF);

  // /*!< DeInitializes the SDIO peripheral */
  // SDIO_DeInit();
  
  // /* Disable the SDIO APB2 Clock */
  // RCC_APB2PeriphClockCmd(RCC_APB2Periph_SDIO, DISABLE);

  // GPIO_PinAFConfig(GPIOC, GPIO_PinSource8, GPIO_AF_MCO);
  // GPIO_PinAFConfig(GPIOC, GPIO_PinSource9, GPIO_AF_MCO);
  // GPIO_PinAFConfig(GPIOC, GPIO_PinSource10, GPIO_AF_MCO);
  // GPIO_PinAFConfig(GPIOC, GPIO_PinSource11, GPIO_AF_MCO);
  // GPIO_PinAFConfig(GPIOC, GPIO_PinSource12, GPIO_AF_MCO);
  // GPIO_PinAFConfig(GPIOD, GPIO_PinSource2, GPIO_AF_MCO);

  // /* Configure PC.08, PC.09, PC.10, PC.11 pins: D0, D1, D2, D3 pins */
  // GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 | GPIO_Pin_11;
  // GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
  // GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  // GPIO_Init(GPIOC, &GPIO_InitStructure);

  // /* Configure PD.02 CMD line */
  // GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
  // GPIO_Init(GPIOD, &GPIO_InitStructure);

  // /* Configure PC.12 pin: CLK pin */
  // GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12;
  // GPIO_Init(GPIOC, &GPIO_InitStructure);
// }

/**
  * @brief  Initializes the SD Card and put it into StandBy State (Ready for 
  *         data transfer).
  * @param  None
  * @retval None
  */
  
// !!wmh (single line commented block below)
// void SD_LowLevel_Init(void)
// {
  // GPIO_InitTypeDef  GPIO_InitStructure;

  // /* GPIOC and GPIOD Periph clock enable */
  // RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC | RCC_AHB1Periph_GPIOD | SD_DETECT_GPIO_CLK, ENABLE);

  // GPIO_PinAFConfig(GPIOC, GPIO_PinSource8, GPIO_AF_SDIO);
  // GPIO_PinAFConfig(GPIOC, GPIO_PinSource9, GPIO_AF_SDIO);
  // GPIO_PinAFConfig(GPIOC, GPIO_PinSource10, GPIO_AF_SDIO);
  // GPIO_PinAFConfig(GPIOC, GPIO_PinSource11, GPIO_AF_SDIO);
  // GPIO_PinAFConfig(GPIOC, GPIO_PinSource12, GPIO_AF_SDIO);
  // GPIO_PinAFConfig(GPIOD, GPIO_PinSource2, GPIO_AF_SDIO);

