mauzybroadway/microsynth/windows/wetzel_440S15_project/added/stm324xg_eval-reduced.c
  // /*!< Configure sEE_I2C pins: SDA */
  // GPIO_InitStructure.GPIO_Pin = sEE_I2C_SDA_PIN;
  // GPIO_Init(sEE_I2C_SDA_GPIO_PORT, &GPIO_InitStructure);

  // /* Configure and enable I2C DMA TX Stream interrupt */
  // NVIC_InitStructure.NVIC_IRQChannel = sEE_I2C_DMA_TX_IRQn;
  // NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = sEE_I2C_DMA_PREPRIO;
  // NVIC_InitStructure.NVIC_IRQChannelSubPriority = sEE_I2C_DMA_SUBPRIO;
  // NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
  // NVIC_Init(&NVIC_InitStructure);

  // /* Configure and enable I2C DMA RX Stream interrupt */
  // NVIC_InitStructure.NVIC_IRQChannel = sEE_I2C_DMA_RX_IRQn;
  // NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = sEE_I2C_DMA_PREPRIO;
  // NVIC_InitStructure.NVIC_IRQChannelSubPriority = sEE_I2C_DMA_SUBPRIO;
  // NVIC_Init(&NVIC_InitStructure);   
  
  // /* Disable and Deinitialize the DMA Streams */
  // DMA_Cmd(sEE_I2C_DMA_STREAM_TX, DISABLE);
  // DMA_Cmd(sEE_I2C_DMA_STREAM_RX, DISABLE);
  // DMA_DeInit(sEE_I2C_DMA_STREAM_TX);
  // DMA_DeInit(sEE_I2C_DMA_STREAM_RX);
// }

/**
  * @brief  Initializes peripherals used by the I2C EEPROM driver.
  * @param  None
  * @retval None
  */
// !!wmh (single line commented block below)
// void sEE_LowLevel_Init(void)
// {
  // GPIO_InitTypeDef  GPIO_InitStructure; 
   
  // /*!< sEE_I2C Periph clock enable */
  // RCC_APB1PeriphClockCmd(sEE_I2C_CLK, ENABLE);
  
  // /*!< sEE_I2C_SCL_GPIO_CLK and sEE_I2C_SDA_GPIO_CLK Periph clock enable */
  // RCC_AHB1PeriphClockCmd(sEE_I2C_SCL_GPIO_CLK | sEE_I2C_SDA_GPIO_CLK, ENABLE);

  // RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);
  
  // /* Reset sEE_I2C IP */
  // RCC_APB1PeriphResetCmd(sEE_I2C_CLK, ENABLE);
  
  // /* Release reset signal of sEE_I2C IP */
  // RCC_APB1PeriphResetCmd(sEE_I2C_CLK, DISABLE);
 
  // /*!< GPIO configuration */
  // /* Connect PXx to I2C_SCL*/
  // GPIO_PinAFConfig(sEE_I2C_SCL_GPIO_PORT, sEE_I2C_SCL_SOURCE, sEE_I2C_SCL_AF);
  // /* Connect PXx to I2C_SDA*/
  // GPIO_PinAFConfig(sEE_I2C_SDA_GPIO_PORT, sEE_I2C_SDA_SOURCE, sEE_I2C_SDA_AF);  
  
  // /*!< Configure sEE_I2C pins: SCL */   
  // GPIO_InitStructure.GPIO_Pin = sEE_I2C_SCL_PIN;
  // GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  // GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  // GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
  // GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;
  // GPIO_Init(sEE_I2C_SCL_GPIO_PORT, &GPIO_InitStructure);

  // /*!< Configure sEE_I2C pins: SDA */
  // GPIO_InitStructure.GPIO_Pin = sEE_I2C_SDA_PIN;
  // GPIO_Init(sEE_I2C_SDA_GPIO_PORT, &GPIO_InitStructure);

 
  // /* Configure and enable I2C DMA TX Channel interrupt */
  // NVIC_InitStructure.NVIC_IRQChannel = sEE_I2C_DMA_TX_IRQn;
  // NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = sEE_I2C_DMA_PREPRIO;
  // NVIC_InitStructure.NVIC_IRQChannelSubPriority = sEE_I2C_DMA_SUBPRIO;
  // NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  // NVIC_Init(&NVIC_InitStructure);

  // /* Configure and enable I2C DMA RX Channel interrupt */
  // NVIC_InitStructure.NVIC_IRQChannel = sEE_I2C_DMA_RX_IRQn;
  // NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = sEE_I2C_DMA_PREPRIO;
  // NVIC_InitStructure.NVIC_IRQChannelSubPriority = sEE_I2C_DMA_SUBPRIO;
  // NVIC_Init(&NVIC_InitStructure);  
  
  // /*!< I2C DMA TX and RX channels configuration */
  // /* Enable the DMA clock */
  // RCC_AHB1PeriphClockCmd(sEE_I2C_DMA_CLK, ENABLE);
  
  // /* Clear any pending flag on Rx Stream  */
  // DMA_ClearFlag(sEE_I2C_DMA_STREAM_TX, sEE_TX_DMA_FLAG_FEIF | sEE_TX_DMA_FLAG_DMEIF | sEE_TX_DMA_FLAG_TEIF | \
                                       // sEE_TX_DMA_FLAG_HTIF | sEE_TX_DMA_FLAG_TCIF);
  // /* Disable the EE I2C Tx DMA stream */
  // DMA_Cmd(sEE_I2C_DMA_STREAM_TX, DISABLE);
  // /* Configure the DMA stream for the EE I2C peripheral TX direction */
  // DMA_DeInit(sEE_I2C_DMA_STREAM_TX);
  // sEEDMA_InitStructure.DMA_Channel = sEE_I2C_DMA_CHANNEL;
  // sEEDMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)sEE_I2C_DR_Address;
  // sEEDMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)0;    /* This parameter will be configured durig communication */;
  // sEEDMA_InitStructure.DMA_DIR = DMA_DIR_MemoryToPeripheral; /* This parameter will be configured durig communication */
  // sEEDMA_InitStructure.DMA_BufferSize = 0xFFFF;              /* This parameter will be configured durig communication */
  // sEEDMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
  // sEEDMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
  // sEEDMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
  // sEEDMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
  // sEEDMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
  // sEEDMA_InitStructure.DMA_Priority = DMA_Priority_VeryHigh;
  // sEEDMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Enable;
  // sEEDMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_Full;
  // sEEDMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;
  // sEEDMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;
  // DMA_Init(sEE_I2C_DMA_STREAM_TX, &sEEDMA_InitStructure);

  // /* Clear any pending flag on Rx Stream */
  // DMA_ClearFlag(sEE_I2C_DMA_STREAM_RX, sEE_RX_DMA_FLAG_FEIF | sEE_RX_DMA_FLAG_DMEIF | sEE_RX_DMA_FLAG_TEIF | \
                                       // sEE_RX_DMA_FLAG_HTIF | sEE_RX_DMA_FLAG_TCIF);
  // /* Disable the EE I2C DMA Rx stream */
  // DMA_Cmd(sEE_I2C_DMA_STREAM_RX, DISABLE);
  // /* Configure the DMA stream for the EE I2C peripheral RX direction */
  // DMA_DeInit(sEE_I2C_DMA_STREAM_RX);
  // DMA_Init(sEE_I2C_DMA_STREAM_RX, &sEEDMA_InitStructure);
  
  // /* Enable the DMA Channels Interrupts */
  // DMA_ITConfig(sEE_I2C_DMA_STREAM_TX, DMA_IT_TC, ENABLE);
  // DMA_ITConfig(sEE_I2C_DMA_STREAM_RX, DMA_IT_TC, ENABLE);      
// }

/**
  * @brief  Initializes DMA channel used by the I2C EEPROM driver.
  * @param  None
  * @retval None
  */
// !!wmh (single line commented block below)
// void sEE_LowLevel_DMAConfig(uint32_t pBuffer, uint32_t BufferSize, uint32_t Direction)
// { 
  // /* Initialize the DMA with the new parameters */
  // if (Direction == sEE_DIRECTION_TX)
  // {
    // /* Configure the DMA Tx Stream with the buffer address and the buffer size */
    // sEEDMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)pBuffer;
    // sEEDMA_InitStructure.DMA_DIR = DMA_DIR_MemoryToPeripheral;    
    // sEEDMA_InitStructure.DMA_BufferSize = (uint32_t)BufferSize;  
    // DMA_Init(sEE_I2C_DMA_STREAM_TX, &sEEDMA_InitStructure);  
  // }
  // else
  // { 
    // /* Configure the DMA Rx Stream with the buffer address and the buffer size */
    // sEEDMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)pBuffer;
    // sEEDMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralToMemory;
    // sEEDMA_InitStructure.DMA_BufferSize = (uint32_t)BufferSize;      
    // DMA_Init(sEE_I2C_DMA_STREAM_RX, &sEEDMA_InitStructure);    
  // }
// }

/**
  * @}
  */ 


/**
  * @}
  */ 

/**
  * @}
  */

/**
  * @}
  */    

/**
  * @}
  */ 
    
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
